Rayleigh-Taylor-Instability/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0   0   0   )   // 0
    (1   0   0   )   // 1
    (1   4   0   )   // 2
    (0   4   0   )   // 3
    (0   0   0.01)   // 4
    (1   0   0.01)   // 5
    (1   4   0.01)   // 6
    (0   4   0.01)   // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (128 512 1) simpleGrading (1 1 1)
);

boundary
(
    top         { type patch; faces ( (3 7 6 2) ); }
    bottom      { type wall;  faces ( (0 1 5 4) ); }
    left        { type wall;  faces ( (0 4 7 3) ); }
    right       { type wall;  faces ( (2 6 5 1) ); }
    frontAndBack
    {
        type empty;
        faces ( (0 3 2 1) (4 5 6 7) );
    }
);