Rayleigh-Taylor-Instability/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


phases (water air);

water
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 2.555e-3;   // 3.13e-3 / 1.225
    rho             [1 -3 0 0 0 0 0] 1.225;
}

air
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1.847e-2;   // 3.13e-3 / 0.1694
    rho             [1 -3 0 0 0 0 0] 0.1694;
}

sigma           [1 0 -2 0 0 0 0] 0.01;


// ************************************************************************* //
