Rayleigh-Taylor-Instability/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);


boundaryField
{
    top    
    { 
        type            pressureInletOutletVelocity; 
        value           uniform (0 0 0); 
    }
    bottom 
    { 
        type            slip; 
    }
    left   
    { 
        type            slip; 
    }
    right  
    { 
        type            slip; 
    }
    frontAndBack 
    { 
        type            empty; 
    }
}


// ************************************************************************* //
