Rayleigh-Taylor-Instability/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    top    { type totalPressure; p0 uniform 0; }
    bottom { type fixedFluxPressure; value uniform 0; }
    left   { type fixedFluxPressure; value uniform 0; }
    right  { type fixedFluxPressure; value uniform 0; }
    frontAndBack { type empty; }
}


// ************************************************************************* //
